app/controllers/users_controller.rb

  def index
    if params[:search]
      @query = format_query(params[:search])
      @users = SearchUsers.new(params[:search]).call.ordered_by_points.paginate(page: params[:page], per_page: 20)
    else
      @users = User.active.ordered_by_points
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 11]]

  def show
    @user = User.find(params[:id])
    @reviews = UserReview.where(receiver: @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
SELECT "user_reviews".* FROM "user_reviews" WHERE "user_reviews"."receiver_id" = $1  [["receiver_id", 176]]