app/models/user_review.rb

  def set_receiver_score
    total_size = receiver.received_reviews.length
---
SELECT "user_reviews".* FROM "user_reviews" WHERE "user_reviews"."receiver_id" = $1  [["receiver_id", 34]]